Repository: asim3/kfupm-pledge
Catalog: pledge/locale/*/LC_MESSAGES/django.po
Languages: ar

source: Excel file is not valid!
ar: ملف الإكسل غير صالح!

source: Student {} pledge is already listed in {} Tearm
ar: التعهد للطالب {} في الفصل {} موجود مسبقاَ

source: Row number {} in {} is not valid!
ar: الصف رقم {} في الصفحة {} غير صالح

source: Student {} national ID is not valid!
ar: رقم هوية الطالب {} غير صالح

source: Student {} next tearm is not valid!
ar: رقم الفصل التالي للطالب {} غير صالح

source: Student {} GPA is not valid!
ar: معدل الطالب {} غير صالح

source: Add Student
ar: إضافة طالب

source: Add Students
ar: إضافة الطلاب

source: Arabic
ar: العربية

source: English
ar: الإنجليزية

source: Readmission Pledge Forms
ar: نماذج تعهدات إعادة القبول

source: Admission
ar: القبول

source: You can add new students using an excel file by clicking on the add student link.
ar: يمكنك إضافة طلاب جدد باستخدام ملف اكسل من خلال النقر على رابط إضافة طالب.

source: No
ar: م

source: KFUPM ID
ar: الرقم الجامعي

source: Name
ar: الأسم

source: Approved Date
ar: تاريخ الموافقة

source: Phone
ar: الجوال

source: Phone Guardian
ar: جوال ولي الأمر

source: Pledge
ar: تعهد

source: Pledges
ar: التعهدات

source: condition
ar: مشروط

source: final
ar: نهائي

source: dismiss
ar: إبعاد

source: student
ar: طالب

source: Pledge Type
ar: نوع التعهد

source: Next Tearm
ar: الفصل التالي

source: KFUPM GPA
ar: المعدل المطلوب

source: Guardian Relation
ar: صلة القرابة

source: Low Performance Reasons
ar: أسباب تدني الأداء

source: Low Performance Other Reasons
ar: الأسباب الآخرى لتدني الأداء

source: Date Added
ar: تاريخ التحديث

source: export Date
ar: تاريخ التصدير

source: Is Approved
ar: هل موافق

source: King Fahd University of Petroleum and Minerals ©
ar: جامعة الملك فهد للبترول والمعادن ©

source: All rights reserved
ar: جميع الحقوق محفوظة

source: Dhahran, 31261, Kingdom of Saudi Arabia
ar: الظهران، 31261، المملكة العربية السعودية

source: E-mail:
ar: البريد الإلكتروني

source: Admission and Registration
ar: عمادة القبول والتسجيل

source: Welcom
ar: مرحبا

source: Admin
ar: الإدارة

source: Excel Template
ar: نموذج الإكسل

source: Show Pledge
ar: عرض التعهد

source: Logout
ar: تسجيل الخروج

source: Please contact Admission Department to add your pledge form
ar: يرجى التواصل مع قسم القبول لإضافة تعهدك
